<template>
	<div v-title="'支付协议'">

		<section id="wrapper">
			<h1>电子支付授权书</h1>
			<p>特别提示：</p>
			<p>客户在同意授权书前应完整、仔细地阅读本授权书，客户勾选同意将被视为完全理解并接受以下全部授权书条款。</p>
			<p>客户在停简单（客户端、微信公众号、支付宝服务窗或百度地图停车缴费服务）上勾选同意本支付授权书并提交信用卡信息后，即成为本支付授权书之授权人，该授权即刻发生效力。</p>
			<p>一、授权人兹授权北京停简单信息技术有限公司自授权人停简单之账户或授权人指定信用卡直接扣款以支付在停简单使用停车服务所应支付之服务费用。</p>
			<p>二、授权人应支付之停车服务费用，由北京停简单信息技术有限公司在授权人成功使用停车服务后，依照停简单（客户端）上公布的收费规则计算服务费用并根据本授权书第九条规定的方式通知授权人。</p>
			<p>三、授权人同意北京停简单信息技术有限公司为验证指定信用卡之目的，可以从指定信用卡扣款人民币1元，验证成功后，被扣取款项（即人民币1元）将返还至授权人信用卡账户，到帐时间以银行入账时间为准。</p>
			<p>四、信用卡授权人应向北京停简单信息技术有限公司提供真实姓名、身份证号码、信用卡号码等。信用卡持有人需与授权人为同一人，且其信用卡有效期至少仍在使用期限内。</p>
			<p>五、北京停简单信息技术有限公司有权委托第三方从上述指定账户或信用卡扣款。</p>
			<p>六、有下列情形之一者，除另有约定外，本授权书的效力自该情形发生之日起自动终止：</p>
			<p>1、授权人与发卡行之间就本授权书所指信用卡之契约关系消灭。 </p>
			<p>2、授权人将终止授权之意思表示以书面通知到达北京停简单信息技术有限公司。</p>

			<p>七、授权人若变更卡号、停止使用信用卡或信用卡有效期限及相关资料变更，应及时通知北京停简单信息技术有限公司并变更资料，因授权人未及时通知导致的任何损失均应由授权人承担。</p>
			<p>八、如因指定信用卡过期、挂失、无效、被盗用、被往来银行拒绝等，以致信用卡请款失败时，北京停简单信息技术有限公司有权依据与授权人之消费账单要求授权人支付。</p>
			<p>九、授权人同意其消费产生的服务费用以北京停简单信息技术有限公司记录的数据为准，并由北京停简单信息技术有限公司短信或APP客户端告知授权人，如授权人在2个小时之内未提出异议，即视为授权人同意并授权北京停简单信息技术有限公司在授权人停简单账户或其指定信用卡中划扣服务费用；扣款完成之后，北京停简单信息技术有限公司将会短信告知授权人已完成扣款金额。 如授权人对服务费用存有疑义或发卡行转账金额与应缴服务费用金额不符时，授权人应在48小时内向北京停简单信息技术有限公司提出异议，联系方式为：400-166-0606，并同时提供相关证据以供核实。</p>
			<p>十、授权人如有冒用他人信用卡之行为，须自负法律责任。授权人有且只能绑定一张信用卡。同一张信用卡只能绑定一个停简单账号。</p>
			<p>十一、在使用停简单停车服务的过程中，如授权人未遵从相关规则，则北京停简单信息技术有限公司有权拒绝为授权人提供相关服务，且无需承担任何责任。因授权人的过错导致的任何损失由授权人承担，该等过错包括但不限于：不按照交易提示操作，未及时进行交易操作，遗忘或泄露密码，密码被人破解。</p>
		</section>
	</div>

</template>



<style lang="less" scoped>
	@import '../../assets/css/common.less';
	#wrapper p{
		padding:0 3%;
		line-height:30px;
		color:#787878;
	}
	#wrapper h1{
		line-height:50px;
		text-align:center;
		font-weight:normal;
	}

</style>

