<template>
    <div v-title="'停简单用户服务协议'">
        <div class="wrapper">
            <section class="content">
                <h1>停简单用户服务协议</h1>
                <p>&nbsp;&nbsp;&nbsp;&nbsp;感谢您使用停简单！停简单非常重视用户的隐私。为说明我们会如何收集、使用和存储您的个人信息及您享有何种权利，我们将通过本指引向您阐述相关事宜，希望您仔细阅读，在需要时，按照本《用户服务协议》的指引，作出您认为适当的选择。您使用停简单，表明您已阅读、理解并同意接受以下条款的约束。如果您对本协议的条款有疑问，您可通过在线客服或客服电话400-166-0606与我们联系。其要点如下：</p>
                <p>1、我们将逐一说明我们收集的您的个人信息类型及其对应的用途，以便您了解我们针对某一特定功能所收集的具体个人信息的类别、使用理由及收集方式。</p>
                <p>2、我们不会主动共享或转让您的个人信息至第三方，如存在其他共享或转让您的个人信息情形时，我们会征得您的明示同意。</p>
                <p>3、您可以通过本指引所列途径访问、更正、删除您的个人信息，也可以撤回同意、注销账号。</p>
                <h2>请根据以下索引阅读相应章节：</h2>
                <p>• 收集的信息</p>
                <p>• 使用和收集信息</p>
                <p>• 共享、转让、公开披露您的个人信息</p>
                <p>• 保护和保存您的个人信息</p>
                <p>• 您的权利</p>
                <p>• 未成年人保护</p>
                <p>• 隐私协议的适用范围</p>
                <p>• 变更</p>
                <p>• 联系我们</p>
                <h2>一、我们可能收集的信息</h2>
                <p>1、身份信息(包括身份证、军官证、护照、驾驶证等)；</p>
                <p>2、网络身份标识信息(包括系统账户、IP地址、邮箱地址及与前述有关的密码等)；</p>
                <p>3、财产信息(交易和消费记录、以及余额、优惠券、等虚拟财产信息)；</p>
                <p>4、车辆信息(包括机动车车牌号、发动机号、车辆品牌、购买日期等车辆相关信息)；</p>
                <p>5、上网记录(包括网站浏览记录、软件使用记录、点击记录)；</p>
                <p>6、常用设备信息(包括硬件型号、设备MAC地址、操作系统类型、软件列表唯一设备识别码(如 IMEI/AndroidID/IDFA/0penUDID/GUID、SIM卡IMSI信息等在内的描述个人常用设备基本情况的信息；
                </p>
                <p>7、位置信息(包括行程信息、精准定位信息、经纬度等)； 我们提供服务时，会收集、储存和使用下列与您有关的信息。如果您不提供相关信息，可能无法注册成为我们的用户或无法享受我们提供的某些服务，或者无法达到相关服务拟达到的效果。
                </p>
                <p>（一）您提供并授权我们使用的个人信息：</p>
                <p>1、用户注册：您在注册账户或使用我们的服务时，需要至少向我们提供您将使用的停简单账户、密码、您本人的手机号码、机动车辆车牌号码、我们将通过发送短信验证码的方式来验证您的身份是否有效。您的账户信息将有助于我们为您提供个性化服务推荐和更优的用户服务体验，如果您不提供补充信息，不会影响您正常使用停简单智慧停车、自动付费的基本功能。</p>
                <p>2、停车场、停车位搜索：为了快速地找到您所需要的停车场、 停车位信息，我们可能会收集您使用我们的产品或服务的设备信息 (包括设备名称、 设备型号、设备识别码、操作系统和应用程序版本、语言设置、分别率、服务提供商网络ID(PLMN) )。</p>
                <p>3、通过搜索来精准地找到您需要的服务信息。我们会保留您的搜索内容以方便您重复输入或为您展示与您搜索内容相关联的服务。请您注意，您的搜索关键词信息无法单独识别您的身份，不属于您的个人信息，我们有权以任何目的对其进行使用； 只有当您的搜索关键词信息与您的其他信息互相结合使用并可以识别您的身份时，则在结合使用期间，我们会将您的搜索关键词信息作为您的个人信息，与您的搜索历史记录一同按照本隐私协议对其进行处理和保护。</p>
                <p>4、支付功能：您可以选择停简单合作的第三方支付机构(包括微信支付及支付宝等支付通道，以下简称“支付机构”)所提供的支付服务。支付功能本身并不收集您的个人信息，但我们需要将您的订单号与交易金额信息与这些支付机构共享以实现其确认您的支付指令并完成支付。“关联方”指一方现在或将来控制、受控制或与其处于共同控制下的任何公司、 机构以及上述公司或机构的法定代表人 。 “控制”是指直接或间接地拥有影响所提及公司管理的能力，无论是通过所有权、有投票权的股份、合同或其他被人民法院认定的方式。</p>
                <p>5、客服与售后功能：我们的电话客服和售后功能会使用您的账号信息和订单信息 。</p>
                <p>6、为保证您的账号安全，我们的呼叫中心客服和在线客服会使用您的账户信息与您核验身份。当您需要我们提供与您订单信息相关的客服与售后服务时，我们将会査询您的订单信息。您有可能会在与我们的客服人员沟通时，提供给出上述信息外的其他信息，如当您要求我们变更配送地址、联系人或联系电话等。</p>
                <p>（二）改进产品与服务所必须的功能</p>
                <p>我们可能会收集您的订单信息、浏览信息、兴趣爱好(您可以在账户设置中选择)进行数据分析以形成用户画像，我们还可能为了提供服务及改进服务质量需要获得其他信息，包括您与客服联系时提供的相关信息，参与问巻调查时向我们发送的问卷答复信息，以及您与我们的关联方、合作伙伴之间互动时获得的相关信息。对于从您的各种设备上收集到的信息，我们可能会将它们进行关联，以便我们能在这些设备上为您提供一致的服务。我们将来可能会自某项服务的信息与来自其他服务的信息结合起来，以便为您提供服务，个性化内容和建议。</p>
                <p>（三）保障交易安全所必须的功能</p>
                <p>为提高您使用我们的产品与/或服务时系统的安全性，更准确地预防钓鱼网站欺诈和保护安全，我们可能会通过了解您的浏览信息、订单信息、您常用的软件信息、设备信息等手段来判断您的账号风险，并可能会记录一些我们认为有风险的链接(“URL”)；我们也会收集您的设备信息对于停简单系统问题进行分析、统计流量并排查可能存在的风险、在您选择向我们发送异常信息时予以排查。</p>
                <p>（四）您可选择是否授权我们收集和使用您的个人信息：</p>
                <p>1、为使您的停车更便捷或更有可选择性，提升您在停简单平台上的良好体验，我们以下附加功能中可能会收集和使用您的个人信息。如果您不提供这些个人信息，您依然可以使用停简单停车服务，但您可能无法使用其所带来的附加功能或在享受某些功能服务时需要重复填写一些信息。这些附加功能包括：</p>
                <p>&nbsp;&nbsp;&nbsp;&nbsp;基于位置信息的个性化推荐功能：我们会收集您的位置信息(我们仅收集您当时所处的地理位置，但不会将您各时段的位置信息进行结合以判断您的行踪轨迹)来判断您所处的地点，自动为您推荐您所在区域可以享受的服务。比如向您推荐最近的停车场。</p>
                <p>2、上述附加功能可能需要您在设备中开启地理位置(位置信息)、相册(图片库)、麦克风以及通讯录的访问权限，以实现这些功能所渉及的信息的收集和使用。</p>
                <p>（五）以下情形中，我们收集、使用个人信息无需征得您的授权同意：</p>
                <p>1、国家安全、国防安全有关的；</p>
                <p>2、公共安全、公共卫生、重大公共利益有关的；</p>
                <p>3、犯罪侦查、起诉、审判和判决执行等有关的；</p>
                <p>4、出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；</p>
                <p>5、所收集的个人信息是个人信息主体自行向社会公众公开的；</p>
                <p>6、从合法公开披露的信息中收集的个人信息如：合法的新闻报道、政府信息公开等渠道；</p>
                <p>7、根据您的要求签订合同所必需的；</p>
                <p>8、用于维护所提供的产品与或服务的安全稳定运行所必需的，例如发现、处置产品与/或服务的故障；</p>
                <p>9、为合法的新闻报道所必需的；</p>
                <p>10、学术研究机构基于公共利益开展统计或学术研究所必要，且对外提供学术研究或描述的结果时，对结果中所包含的个人信息进行去标识化处理的；</p>
                <p>11、法律法规规定的其他情形。</p>
                <p>（六）从第三方获得的个人信息：</p>
                <p>我们可能从第三方获取您授权共享的账户信息 (头像、昵称)，并在您同意本隐私协议后将您的第三方帐户与停简单账户绑定，您可以通过第三方账户直接登录并使用产品与/或服务。我们将依据与第三方的约定、对个人信息来源的合法性进行确认后，在符合相关法律和法规规定的前提下，使用您的这些个人信息。</p>
                <p>（七）个人信息使用规则：</p>
                <p>1、我们会根据本隐私协议的约定并为实现我们的产品与/或服务功能对所收集的个人信息进行使用。</p>
                <p>2、在收集个人信息后，我们将通过技术手段对数据进行去标识化处理，去标识化处理的信息将无法识别主体。请您了解并同意，在此情况下我们有权使用已经去标识化的信息，并在不透露您个人信息的前提下，有权对用户数据库进行分析并予以商业化的利用。</p>
                <p>3、请您注意，您在使用我们的产品或服务时所提供的个人信息，除非您删除或通过系统设置拒绝我们收集，否则将在使用我们的产品或服务期间持续授权我们使用。在您注销账号时，我们将停止使用并删除您的个人信息。</p>
                <p>4、我们会对产品与/或服务使用情况进行统计，并可能会与公众或第三方共享这些统计信息，以展示我们的产品与/或服务的整体使用趋势。这些统计信息不包含您的任何身份识别信息。</p>
                <p>5、我们展示您的个人信息时，会采用包括内容替换、匿名处理方式对信息进行脱敏，以保护您的信息安全。</p>
                <p>6、当我们要将您的个人信息用于本政策未载明的其它用途时，或基于特定目的收集而来的信息用于其他目的时，会通过您主动做出勾选的形式事先征求您的同意。</p>
                <h2>二、使用和收集信息</h2>
                <p>（一）Cookies的使用</p>
                <p>1、为实现联机体验的个性化需求，获得更轻松的访问体验。 我们会在您的计算机或移动设备上发送一个或多个名为Cookies的小数据文件，指定给您的Cookies是唯一的，它只能被将Cookies发布给您的域中的Web服务器读取。我们向您发送Cookies是为了简化重复登录的步骤、存储购物偏好或购物车中的商品等数据进而提供购物的偏好设置、帮助优化对广告的选择与互动、帮助判断登录状态以及账户或数据安全。</p>
                <p>2、我们不会将Cookies用于本隐私协议所述目的之外的其他用途。 您可根据自己的偏好管理或删除Cookies，可以清除计算机上保存的所有Cookies（大部分网络浏览器会自动接受Cookies），您可根据自己的需要来修改浏览器的设置以拒绝Cookies；另外，您也可以清除软件内保存的所有Cookies。但如果您这么做，您可能需要在每一次访问停简单网站时亲自更改用户设置，而且您之前所记录的相应信息也均会被删除，并且可能会对您所使用服务的安全性有一定影响。</p>
                <p>3、网络Beacon和同类技术的使用</p>
                <p>除Cookie外，我们还会在网站上使用网络Beacon等其他同类技术。我们的网页上常会包含一些电子图像(称为"单像素"GIF文件)。我们使用网络Beacon的方式有：</p>
                <p>A、通过在停简单平台或网站上使用网络Beacon，计算用户访问数量，并通过访问Cookie辨认注册的停简单。</p>
                <p>B、通过得到的Cookies信息，为您提供个性化服务。</p>
                <h2>三、共享、转让、公开披露个人信息</h2>
                <p>(一）、共享</p>
                <p>1、我们不会与停简单以外的任何公司、组织和个人共享您的个人信息，但以下情况除外：</p>
                <p>A、事先获得您明确的同意或授权；</p>
                <p>B、根据适用的法律法规、法律程序的要求、强制性的行政或司法要求所必须的情况下进行提供；</p>
                <p>C、在法律法规允许的范围内，为维护停简单、停简单的关联方或合作伙伴、您或其他停简单用户或社会公众利益、财产或安全免遣损害而有必要提供；</p>
                <p>D、只有共享您的信息，才能实现我们的产品与或服务的核心功能或提供您需要的服务；</p>
                <p>E、应您需求处理您与他人的纠纷或争议；</p>
                <p>F、符合与您签署的相关协议或其他的法律文件约定所提供；</p>
                <p>G、基于学术研究而使用；</p>
                <p>H、基于符合法律法规的社会公共利益而使用。</p>
                <p>2、我们可能会将您的个人信息与我们的关联方共享。但我们只会共享必要的个人信息，且受本隐私协议中所声明目的的约束。我们的关联方如要改变个人信息的处理目的，将再次征求您的授权同意。</p>
                <p>3、我们可能会向合作伙伴等第三方共享您的账户信息、设备信息以及位置信息，以保障为您提供的服务顺利完成。但我们仅会出于合法、正当、必要、特定、明确的目的共享您的个人信息，并且只会共享提供服务所必要的个人信息。 我们的合作伙伴无权将共享的个人信息用于任何其他用途。 我们的合作伙伴包括以下类型：</p>
                <p>A、技术服务的供应商。我们可能会将您的个人信息共享给支持我们功能的第三方。这些支持包括为我们的供货或提供基础设施技术服务、支付服务、数据处理等。 共享这些信息的目的是可以实现我们产品与或服务的核心功能，比如我们需要将您的支付金额与第三方支付机构共享以实现其确认您的支付指令并完成支付等。</p>
                <p>B、委托我们进行推广的合作伙伴。有时我们会代表其他企业向使用我们产品与/或服务的用户群提供促销推广的服务。我们可能会使用您的个人信息以及您的非个人信息集合形成的间接用户画像与委托我们进行推广的合作伙伴(“委托方”)共享，但我们仅会向这些委托方提供推广的覆盖面和有效性的信息，而不会提供您的个人身份信息，或者我们将这些信息进行汇总，以便它不会识别您个人。比如我们可以告知该委托方有多少人看了他们的推广信息或在看到这些信息后购买了委托方的商品，或者向他们提供不能识别个人身份的统计信息，帮助他们了解其受众或顾客。</p>
                <p>4、对我们与之共享个人信息的公司、组织和个人，我们会与其签署严格的保密协定，要求他们按照我们的说明、本隐私协议以及其他任何相关的保密和安全措施来处理个人信息。</p>
                <p>5、为了遵守法律、执行或适用我们的使用条件和其他协议，或者为了保护停简单、您或其他停简单客户的权利及其财产或安全，比如为防止欺诈等违法活动和减少信用风险，而与其他公司和组织交换信息。不过，这并不包括违反本隐私协议中所作的承诺而为获利目的出售、出租、共享或以其它方式披露的个人信息。</p>
                <p>（二）、转让</p>
                <p>我们不会将您的个人信息转让给任何公司、组织和个人，但以下情况除外：</p>
                <p>1、事先获得您明确的同意或授权；</p>
                <p>2、根据适用的法律法规、法律程序的要求、强制性的行政或司法要求所必须的情况进行提供；</p>
                <p>3、符合与您签署的相关协议(包括在线签署的电子协议以及相应的平台规则)或其他的法律文件约定所提供；</p>
                <p>4、在涉及合并、收购、资产转让或类似的交易时，如涉及到个人信息转让，我们会要求新的持有您个人信息的公司、组织继续受本隐私协议的约束，否则，我们将要求该公司、组织重新向您征求授权同意。</p>
                <p>（三）、公开披露</p>
                <p>我们仅会在以下情况下，且采取符合业界标准的安全防护措施的前提下，才会公开披露您的个人信息：</p>
                <p>1、根据您的需求，在明确同意的披露方式下披露您所指定的个人信息；</p>
                <p>2、根据法律、法规的要求、强制性的行政执法或司法要求所必须提供您个人信息的情况下，我们可会依据所要求的个人信息类型和披露方式公开披露您的个人信息。在符合法律法规的前提下，当我们收到上述披露信息的请求时，我们会要求必须出具与之相应的法律文件，如传票或调查函。我们坚信，对于要求我们提供的信息，应该在法律允许的范围内尽可能保持透明。我们对所有的请求都进行了慎重的审查，以确保其具备合法依据，且仅限于执法部门因特定调查目的且有合法权利获取的数据。在法律法规许可的前提下，我们披露的文件均在加密密钥的保护之下。</p>
                <h2>四、保护和保存个人信息</h2>
                <p>1、我们非常重视个人信息安全，并采取一切合理可行的措施，保护您的个人信息</p>
                <p>A、数据安全技术措施：我们会采用符合业界标准的安全防护措施，包括建立合理的制度规范、安全技术来防止您的个人信息遭到未经授权的访问使用、修改避免数据的损坏或丢失。我们的网络服务采取了传输层安全协议等加密技术，通过https等方式提供浏览服务，确保用户数据在传输过程中的安全。我们采取加密技术对用户个人信息进行加密保存，并通过隔离技术进行隔离。在个人信息使用时，例如个人信息展示、个人信息关联计算，我们会采用包括内容替换、SHA256在内多种数据脱敏技术增强个人信息在使用中安全性。我们采用严格的数据访问权限控制和多重身份认证技术保护个人信息，避免数据被违规使用。我们采用代码安全自动检查、数据访问日志分析技术进行个人信息安全审计。</p>
                <p>B、保护个人信息采取的其他安全措施 通过建立数据分类分级制度、数据安全管理规范、数据安全开发规范来管理规范个人信息的存储和使用。通过信息接触者保密协议、监控和审计机制来对数据进行全面安全控制。为加强安全意识，我们还会举办安全和隐私保护培训课程，加强员工对于保护个人信息重要性的认识。
                </p>
                <p>C、我们仅允许有必要知晓这些信息的停简单及停简单关联方的员工、合作伙伴访问个人信息，并为此设置了严格的访问权限控制和监控机制。我们同时要求可能接触到您个人信息的所有人员屐行相应的保密义务。如果未能履行这些义务，可能会被追究法律责任或被中止与停简单的合作关系。</p>
                <p>D、我们会釆取一切合理可行的措施，确保未收集无关的个人信息。我们只会在达成本政策所述目的所需的期限内保留您的个人信息，除非需要延长保留期或受到法律的允许。</p>
                <p>E、互联网并非绝对安全的环境，而且电子邮件即时通讯、社交软件等与其他用户的交流方式无法确定是否完全加密，我们建议您使用此类工具时请使用复杂密码，并注意保护您的个人信息安全。</p>
                <p>F、互联网环境并非百分之百安全，我们将尽力确保或担保您发送给我们的任何信息的安全性。如果我们的物理、技术、或管理防护设施遭到破坏，导致您的合法权益受损，我们将承担相应的法律责任。</p>
                <p>2，安全事件处置</p>
                <p>请您妥善保护自己的个人信息，仅在必要的情形下向他人提供。为应对个人信息泄露、损毁和丢失等可能出现的风险，我们制定了多项制度，明确安全事件、安全漏洞的分类分级标准及相应的处理流程。我们也为安全事件建立了专门的应急响应团队，按照安全事件处置规范要求，针对不同安全事件启动安全预案，进行止损、分析、定位、制定补救措施、联合相关部门进行溯源和打击。在不幸发生个人信息安全事件后，我们将按照法律法规的要求，及时向您告知：安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。我们同时将事件相关情况以邮件、信函、电话、推送通知等方式告知您，难以逐一告知个人信息主体时，我们会采取合理、有效的方式发布公告。同时，我们还将按照监管部门要求，主动上报个人信息安全事件的处置情况。</p>
                <p>&nbsp;&nbsp;&nbsp;&nbsp;如果您对我们的个人信息保护有任何疑问，可通过本政策最下方约定的联系方式联系我们。如您发现自己的个人信息泄密，尤其是您的账户及密码发生泄露，请您立即通过本政策最下方约定的联系方式联络我们，以便我们采取相应措施。</p>
                <p>3、个人信息保存</p>
                <p>A、您的个人信息将全被存储于中华人民共和国境内。</p>
                <p>B、除非法律法规另有规定，您的个人信息我们将保存至您账号注销之日后的一个月。我们承诺这是为了保证您在停简单平台上的交易记录的保留，您个人信息在停简单须保存的最短期间。当您的个人信息超出我们所保存的期限后，我们会对您的个人信息进行删除或匿名化处理。</p>
                <p>C、请您注意，当您成功申请注销停简单账户后我们给予您自注销之日起一个月的“后悔期”，在这个期间内您可以随时申请恢复您已经注销的停简单账户。为了实现您恢复您停简单账户的功能，我们将不会在后悔期内对您的个人信息进行删除或匿名化处理。如您在“后悔期”内没有要求恢复您的停简单账户或您明确向我们表述不再恢复您的停简单账户，我们将对您的个人信息进行删除或匿名化处理。</p>
                <p>D、如果我们终止服务或运营，我们会至少提前三十日向您通知，并在终止服务或运营后对您的个人信息进行删除或匿名化处理。</p>
                <h2>五、您如何管理您的个人信息</h2>
                <p>我们非常重视您的个人信息，并尽全力保护您对于您个人信息访问、更正、删除以及撤回同意的权利，以使您拥有充分的能力保障您的隐私和安全。您的权利包括：</p>
                <p>（一）、访问和更正您的个人信息除法律法规规定外，您有权随时访问和更正您的个人信息，具体包括</p>
                <p>1、您的账户信息：您可以在“我的停简单页面“车主服务菜单中查阅您提交给我们的所有个人信息，您也可通过上述途径更新除实名认证信息之外的其他个人信息(您的实名认证信息是您通过实名认证时使用的姓名和身份证信息)，如您需要变更您的实名认证信息，您可拨打400-166-0606服务热线申请变更。</p>
                <p>2、对于您在使用我们的产品与或服务过程中产生的其他个人信息需要访问或更正，请随时联系我们。我们会根据本隐私协议所列明的方式和期限响应您的请求。</p>
                <p>3、您无法访问和更正的个人信息：除上述列明的信息外，您的部分个人信息我们还无法为您提供访问和更正的服务，这些信息主要是为了提升您的用户体验和保证交易安全所收集的您的设备信息、您使用附加功能时产生的个人信息。上述信息我们会在您的授权范围内进行使用，您无法访问和更正，但您可联系我们进行删除或做匿名化处理。</p>
                <p>（二）、删除您的个人信息</p>
                <p>您在我们的产品与或服务页面中可以直接清除或删除的信息。</p>
                <p>在以下情形中，您可以向我们提出删除个人信息的请求：</p>
                <p>1、处理个人信息的行为违反法律法规；</p>
                <p>2、收集、使用您的个人信息，却未征得您的同意；</p>
                <p>3、处理个人信息的行为违反了与您的约定；</p>
                <p>4、注销了停简单账户；</p>
                <p>5、如果我们终止服务及运营。若我们决定响应您的删除请求，我们还将同时通知从我们获得您的个人信息的实体，要求其及时删除，除非法律法规另有规定，或这些实体获得您的独立授权。当您从我们的服务中删除信息后，我们可能不会立即在备份系统中删除相应的信息，但会在备份更新时删除这些信息。但法律法规规定要求我们必须尽到保存、记录、备份等义务的情形除外。</p>
                <p>（三）、改变授权同意的范围或撤回授权；您可以通过删除信息、关闭设备功能、在停简单网站或软件中进行隐私设置等方式改变您授权我们继续收集个人信息的范围或撤回您的授权。您也可以通过注销账户的方式，撤回我们继续收集您个人信息的全部授权。</p>
                <p>（四）、为了保护您的隐私，我们不会以任何方式和途径向您推送涉及宗教信仰、性、疾病等相关敏感內容的促销或商品信息给您。</p>
                <p>（五）、响应您的请求如果您无法通过上述方式访问、更正或删除您的个人信息，或您需要访问、更正或删除您在使用我们产品与或服务时所产生的其他个人信息，或您认为我们存在任何违反法律法规或与您关于个人信息的收集或使用的约定，您均可以发送电子邮件至kefu@tingjiandan.com或通过本协议下方的其他方式与我们联系。为了保障安全，我们可能需要您提供书面请求，或以其他方式证明您的身份，我们将在收到您反馈并验证您的身份后的30天内答复您的请求。对于您合理的请求，我们原则上不收取费用，但对多次重复、超出合理限度的请求，我们将视情况收取一定成本费用。对于那些无端重复、需要过多技术手段(例如，需要开发新系统或从根本上改变现行惯例)、给他人合法权益带来风险或者非常不切实际(例如，涉及备份磁带上存放的信息)的请求，我们可能会予以拒绝。</p>
                <p>（六）、在以下情形中，按照法律法规要求，我们将无法响应您的请求：</p>
                <p>1、国家安全、国防安全有关的；</p>
                <p>2、公共安全、公共卫生、重大公共利益有关的</p>
                <p>3、犯罪侦查、起诉和审判等有关的；</p>
                <p>4、充分证据表明您存在主观恶意或滥用权利的</p>
                <p>5、响应您的请求将导致您或其他个人、组织的合法权益受到严重损害的。</p>
                <h2>六、未成年人保护</h2>
                <p>我们非常重视对未成年人个人信息的保护。根据相关法律法规的规定，若您是18周岁以下的未成年人，在使用停简单服务前，应事先取得您的家长或法定监护人的书面同意。若您是未成年人的监护人，当您对您所监护的未成年人的个人信息有相关疑问时，请通过客服热线：400-166-0606联系我们。</p>
                <h2>七、隐私协议适用范围</h2>
                <p>本协议之效力、解释、变更、执行与争议解决均适用中华人民共和国法律。因本协议产生之争议，均应依照中华人民共和国法律予以处理，并由被告住所地人民法院管辖。</p>
                <h2>八、变更</h2>
                <p>我们可能适时修订本《用户服务协议》的条款，该等修订构成本《用户服务协议》的一部分。如该等修订造成您在本《用户服务协议》下权利的实质减少，我们将在修订生效前通过在主页上显著位置提示或向您发送电子邮件或以其他方式通知您。在该种情况下，若您继续使用我们的服务，即表示同意经修订的本《用户服务协议》的约束。</p>
                <h2>九、联系我们</h2>
                <p>1、如您对本隐私协议或您个人信息的相关事宜有任何问题、意见或建议，可以发送邮件至kefu@tingjiandan.com或拨打我们的客服电话：400-166-0606与我们联系。</p>
                <p>2、我们尽快审核所涉问题，并在验证您的用户身份后的三十天内予以回复。</p>
                <h2>注意：如果我们监测到您将停简单的产品及服务以及相关信息用于欺诈或非法目的，我们将会采取相应措施，包括但不限于中止或终止向您提供任何产品或服务。 本协议更新日期为：2018年3月1日 正式生效日期为：2018年3月1日
                </h2>
            </section>
            <div class="agreeBtns" v-show="isShowBtns">
                <button class="cancelBtn" @click="notAgree">拒绝</button>
                <button class="confirmBtn" @click="agree">同意</button>
            </div>
        </div>
    </div>
</template>

<script>
    import { util } from 'util'
    import { tjdServices } from '../../assets/js/tjdServices'
    export default {
        data() {
            return {
                isShowBtns:false,
            }
        },
        mounted: function() {
            util.initAPPCommInfo();
            this.init();
//            在新的协议弹窗中不会跳到当前页来进行同意或者不同意协议的操作的,理论上本页只是个静态页,不需要逻辑操作。但是为了兼容老版本app所以还得保留逻辑操作。
        },
        methods: {
            init() {
                var urlParam = util.getUrlParam('isShowAgreeBtns');
                if(!util.isEmpty(urlParam) && urlParam=='true'){
                    this.isShowBtns = true;
                }
            },
            goBack:function () {
                var backUrl = util.getSession('versionFrom')
                if(backUrl){
                    location.href = backUrl;
                }else {
                    window.history.go(-1);
                }
            },
            notAgree(){
                if(util.isDispatchPushFromApp()){
                    document.location='webGoBack://';//返回操作
                }else {
                    this.goBack()
                }
            },
            agree(){
                if(util.isDispatchPushFromApp()){
                    document.location='signTJDP://';//执行app同意协议接口
                }else {
                    var version = util.getUrlParam('agreementVersion')
                    if(!util.isEmpty(version) && this.isShowBtns){
                        tjdServices.request({
                            method: 'agreeTJDP',
                            agreementVersion:version
                        }).then(data => {
                            this.goBack()
                        })
                    }
                }
            }
        }
    }
</script>

<style lang="less" scoped>
    @import '../../assets/css/common.less';
    .wrapper {
        width: 100%;
    }

    .content p {
        padding: 0 3%;
        line-height: 28px;
        color: #787878;
        font-size: 14px;
    }

    .content p b {
        color: #666;
    }

    .content h1 {
        line-height: 50px;
        text-align: center;
        font-size: 15px;
    }

    .content h2 {
        padding: 0 3%;
        line-height: 30px;
        font-size: 14px;
    }

    .agreeBtns{
        width: 100%;
        margin: 2em 0;
        overflow: hidden;
        text-align: center;
        button{
            -webkit-appearance: normal;
            background-color: rgba(255, 255, 255, 0.8);
            padding: 5% 15% 6%;
            overflow: hidden;
            margin: 0 0.2em;
            outline: none;
            background-color: #fff;
            font-size: 16px;
            color: #999;
            border: none;
            box-sizing: border-box;
        }
        button.confirmBtn {
            background: url("../../assets/images/common/agreedto_normal.png") no-repeat;
            background-size: 100% 100%;
            color: #fff;
            float: right;
            margin-right: 7%;
        }
        button.cancelBtn{
            background: url("../../assets/images/common/refusedto_normal.png") no-repeat;
            background-size: 100% 100%;
            color: #999;
            float: left;
            margin-left: 7%;
        }
    }
</style>

